#Задание 1
drive_exam = (1,2,3,2,1,2,1,3,1,2,1,2,3,3,2,1,2,1,2,1)
answers = input('введите ваши ответы: ')
if answers == str(drive_exam):
    print('Экзамен сдан')
else:
    print('Экзамен провален')